# Normalización Z-score

## Ejercicio: 

1. Importe el archivo `Salary Data.csv` a un DataFrame de pandas.
2. Filtre el DataFrame para mantener solo las columnas de tipo numérico.
3. Aplique la transformación Z-score.
4. Para el DataFrame estandarizado, calcule y muestre la **media** (`mean()`) y **desviación estándar** (`std()`) de cada característica.

In [11]:
#1. Importe el archivo `Salary Data.csv` a un DataFrame de pandas.
import pandas as pd
import numpy as np
import random
import matplotlib.pyplot as plt
import seaborn  as sns

df = pd.read_csv('../data/Salary Data.csv')
display(df.shape)
df.head()

(375, 6)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [12]:
# 2. Filtrar columnas numéricas
df_numericos = df.select_dtypes(include=['number'])
#Dimensiones de sub dataframe con valores numericos
display(df_numericos.shape)
#primeras filas de sub dataframe
df_numericos.head()

(375, 3)

    Age  Years of Experience    Salary
0  32.0                  5.0   90000.0
1  28.0                  3.0   65000.0
2  45.0                 15.0  150000.0
3  36.0                  7.0   60000.0
4  52.0                 20.0  200000.0

In [13]:
#3. Aplique la transformación Z-score.
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df_estandarizados = pd.DataFrame(scaler.fit_transform(df_numericos), 
                              columns=df_numericos.columns)
df_estandarizados.head()

        Age  Years of Experience    Salary
0 -0.769398            -0.768276 -0.219559
1 -1.336003            -1.073702 -0.738498
2  1.072068             0.758859  1.025892
3 -0.202793            -0.462849 -0.842285
4  2.063627             1.522426  2.063768

In [15]:
#Para el DataFrame estandarizado, calcule y muestre la media (mean()) y 
#desviación estándar (std()) de cada característica.
print("Medias de df_estandarizados:")
print(df_estandarizados.mean())
print("\nDesviaciones estándar de df_estandarizados:")
print(df_estandarizados.std())

Medias de df_estandarizados:
Age                   -3.333646e-16
Years of Experience    1.785882e-17
Salary                 1.238211e-16
dtype: float64

Desviaciones estándar de df_estandarizados:
Age                    1.001343
Years of Experience    1.001343
Salary                 1.001343
dtype: float64